Repository: teknology-hub/tek-steamclient
Catalog: po/*.po
Languages: ru

source: Usage: tek-sc-cli - run interactively, allowing you to enter commands one at a time OR tek-sc-cli <option> - see options below OR tek-sc-cli <commands...> - execute commands with their arguments in order they appear in the command line, then exit. See commands below Options: --version Display tek-steamclient version and exit --help Display this message and exit Commands: help (interactive mode only) List available commands exit (interactive mode only) Exit the program quit (interactive mode only) Synonym for "exit"
ru: Использование: tek-sc-cli - запустить в интерактивном режиме, в котором команды вводятся последовательно вручную ИЛИ tek-sc-cli <опция> - см. опции ниже ИЛИ tek-sc-cli <команды...> - выполнить команды в порядке, в котором они указаны в командной строке, затем завершить работу. См. команды ниже Опции: --version Отобразить версию tek-steamclient и завершить работу --help Отобразить это сообщение и завершить работу Команды: help (только в интерактивном режиме) Вывести список доступных команд exit (только в интерактивном режиме) Завершить работу программы quit (только в интерактивном режиме) Синоним "exit"

source: Application manager: am init <path> Initialize application manager at specified directory, allowing the following commands to be used. <path> may be specified as empty string ("") to use current working directory am close Close current application manager instance, allowing it to be initialized in another directory later am set-workshop-dir <path> Set Steam Workshop directory path for current application manager instance. You cannot run jobs for Steam Workshop items before executing this command am status (interactive mode only) Get current status of all items managed by current application manager instance am check-for-updates Check for all item updates. The results can be viewed via "am status" command For the commands below, <item_id> is either <app_id>-<depot_id> or <app_id>-<depot_id>-<workshop_item_id> am create-job <item_id> <manifest_id> <force_verify> Create a job for specified item. This command won't run the created job automatically, for that use "run-job" command. Only one job can exist for an item at a time; if you want to create another job, the previous one must be successfully finished or cancelled first. <manifest_id> can be ID of the manifest to update to or verify against, or 0 to use ID of the latest available manifest, or -1 to uninstall the item. <force_verify> must be either "true" or "false"; if "true", file verification will still be performed even if it's otherwise not necessary am run-job <item_id> Run/resume a job for specified item. It can be paused by sending a SIGINT signal (Ctrl+C) or terminating the program am cancel-job <item_id> Cancel a job for specified item, cleaning up its cache directory and resetting its state
ru: Менеджер приложений: am init <путь> Инициализировать менеджер приложений в указанной папке, что необходимо для использования последующих команд. <путь> может быть указан пустой строкой ("") для использования текущей рабочей директории am close Закрыть текущий менеджер приложений, позволяя затем инициализировать его в другой папке am set-workshop-dir <путь> Установить путь к папке для объектов Мастерской Steam для текущего менеджера приложений. Запускать задачи для объектов Мастерской Steam невозможно до выполнения этой команды am status (только в интерактивном режиме) Отобразить текущий статус всех объектов под управлением текущего менеджера приложений am check-for-updates Проверить наличие обновлений для всех объектов. Результат можно увидеть с помощью команды "am status" В нижеприведённых командах, <id_объекта> может быть либо <app_id>-<depot_id>, либо <app_id>-<depot_id>-<workshop_item_id> am create-job <id_объекта> <id_манифеста> <проверять> Создать задачу для указанного объекта. Эта команда не запустит созданную задачу автоматически, для этого используйте команду "run-job". У каждого объекта одновременно может быть только одна задача; для создания другой задачи, предыдущая должна быть сначала успешно завершена либо отменена. <id_манифеста> может быть ID манифеста, до которого нужно обновиться, или относительно которого нужно проверить файлы, либо 0, чтобы использовать ID последнего доступного манифеста, либо -1, чтобы деинсталлировать объект. <проверять> должен быть либо "true" либо "false"; если "true", проверка файлов будет произведена даже если в ней нет текущей необходимости am run-job <id_объекта> Запустить/возобновить задачу для указанного объекта. Она может быть приостановлена посылкой сигнала SIGINT (Ctrl+C) или завершением работы программы am cancel-job <id_объекта> Отменить задачу для указанного объекта, путём очистки её кэша и сброса состояния

source: am dump <type> <item_id> <manifest_id> Dump specified tek-steamclient content file into a human-readable text file at current working directory. The file must be present in current application manager's directories, i.e. for manifests they must've been downloaded before, for other types there must be a job paused after creating that file. <type> must be one of: "manifest", "patch", "vcache", "delta". <manifest_id> is only used when <type> is "manifest" and can be set to 0 otherwise
ru: am dump <тип> <id_объекта> <id_манифеста> Сделать человекочитаемый дамп указанного файла tek-steamclient в текстовый файл в текущей рабочей директории. Файл должен присутствовать в рабочих папках текущего менеджера приложений, т.е. для манифестов это означает, что они должны уже быть скачаны, для остальных типов должна быть задача, приостановленная после создания этого файла. <тип> должен быть одним из: "manifest", "patch", "vcache", "delta". <id_манифеста> используется только когда указан <тип> "manifest", и может быть указан как 0 в остальных случаях

source: tek-s3 client: s3c sync-manifest <url> Synchronize manifest of tek-s3 server at specified URL, i.e. fetch its depot decryption keys and update list of apps/depots that it can provide manifest request codes for
ru: Клиент tek-s3: s3c sync-manifest <url> Синхронизировать манифест сервера tek-s3 на указанном URL, т.е. получить его ключи дешифрования хранилищ и обновить список приложений/хранилищ, для которых он предоставляет коды запросов манифестов

source: Error: "%s" can only be used in interactive mode
ru: Ошибка: "%s" можно использовать только в интерактивном режиме

source: Error: no command provided for module "am"
ru: Ошибка: не указана команда для модуля "am"

source: Error: <path> not provided for "init"
ru: Ошибка: не указан <путь> для "init"

source: Error: <path> not provided for "set-workshop-dir"
ru: Ошибка: не указана <путь> для "set-workshop-dir"

source: Error: <item_id> not provided for "create-job"
ru: Ошибка: не указан <id_объекта> для "create-job"

source: Error: app ID part of <item_id> for "create-job" is not a number
ru: Ошибка: ID приложения в <id_объекта> для "create-job" не является числом

source: Error: <item_id> for "create-job" doesn't contain a depot ID
ru: Ошибка: <id_объекта> для "create-job" не содержит ID хранилища

source: Error: depot ID part of <item_id> for "create-job" is not a number
ru: Ошибка: ID хранилища в <id_объекта> для "create-job" не является числом

source: Error: Steam Workshop item ID part of <item_id> for "create-job" is not a number
ru: Ошибка: ID работы Мастерской Steam в <id_объекта> для "create-job" не является числом

source: Error: <manifest_id> not provided for "create-job"
ru: Ошибка: не указан <id_манифеста> для "create-job"

source: Error: <manifest_id> for "create-job" is not a number
ru: Ошибка: <id_манифеста> для "create-job" не является числом

source: Error: <force_verify> not provided for "create-job"
ru: Ошибка: не указан <проверять> для "create-job"

source: Error: <force_verify> for "create-job" must be "true" or "false"
ru: Ошибка: <проверять> для "create-job" должен быть "true" или "false"

source: Error: <item_id> not provided for "run-job"
ru: Ошибка: не указан <item_id> для "run-job"

source: Error: app ID part of <item_id> for "run-job" is not a number
ru: Ошибка: ID приложения в <item_id> для "run-job" не является числом

source: Error: <item_id> for "run-job" doesn't contain a depot ID
ru: Ошибка: <item_id> для "run-job" не содержит ID хранилища

source: Error: depot ID part of <item_id> for "run-job" is not a number
ru: Ошибка: ID хранилища в <item_id> для "run-job" не является числом

source: Error: Steam Workshop item ID part of <item_id> for "run-job" is not a number
ru: Ошибка: ID работы Мастерской Steam в <item_id> для "run-job" не является числом

source: Error: <item_id> not provided for "cancel-job"
ru: Ошибка: не указан <item_id> для "cancel-job"

source: Error: app ID part of <item_id> for "cancel-job" is not a number
ru: Ошибка: ID приложения в <item_id> для "cancel-job" не является числом

source: Error: <item_id> for "cancel-job" doesn't contain a depot ID
ru: Ошибка: <item_id> для "cancel-job" не содержит ID хранилища

source: Error: depot ID part of <item_id> for "cancel-job" is not a number
ru: Ошибка: ID хранилища в <item_id> для "cancel-job" не является числом

source: Error: Steam Workshop item ID part of <item_id> for "cancel-job" is not a number
ru: Ошибка: ID работы Мастерской Steam в <item_id> для "cancel-job" не является числом

source: Error: <type> not provided for "dump"
ru: Error: не указан <тип> для "dump"

source: Error: unknown <type> "%s" for "dump"
ru: Ошибка: неизвестный <тип> "%s" для "dump"

source: Error: <item_id> not provided for "dump"
ru: Ошибка: не указан <item_id> для "dump"

source: Error: app ID part of <item_id> for "dump" is not a number
ru: Ошибка: ID приложения в <item_id> для "dump" не является числом

source: Error: <item_id> for "dump" doesn't contain a depot ID
ru: Ошибка: <item_id> для "dump" не содержит ID хранилища

source: Error: depot ID part of <item_id> for "dump" is not a number
ru: Ошибка: ID хранилища в <item_id> для "dump" не является числом

source: Error: Steam Workshop item ID part of <item_id> for "dump" is not a number
ru: Ошибка: ID работы Мастерской Steam в <item_id> для "dump" не является числом

source: Error: <manifest_id> not provided for "dump"
ru: Ошибка: не указан <manifest_id> для "dump"

source: Error: <manifest_id> for "dump" is not a number
ru: Ошибка: <manifest_id> для "dump" не является числом

source: Error: unknown command "%s" for module "am"
ru: Ошибка: неизвестная команда "%s" модуля "am"

source: Error: no command provided for module "s3c"
ru: Ошибка: не указана команда для модуля "s3c"

source: Error: <url> not provided for "sync-manifest"
ru: Ошибка: не указан <url> для "sync-manifest"

source: Error: unknown command "%s" for module "s3c"
ru: Ошибка: неизвестная команда "%s" модуля "s3c"

source: Error: unknown command "%s"
ru: Ошибка: неизвестная команда "%s"

source: The job is estimated to require %.2f GiB of disk space, but only %.2f GiB is available on the disk. Do you want to proceed anyway? [Y/N]:
ru: Для выполнения задачи необходимо %.2f ГиБ дискового пространства, но свободно только %.2f ГиБ. Вы хотите всё равно продолжить выполнение задачи? [Y/N]:

source: Unrecognized input. Please answer Y or N.
ru: Нераспознанный ввод. Пожалуйста введите Y или N.

source: Warning: The job is estimated to require %.2f GiB of disk space, but only %.2f GiB is available on the disk.
ru: Для выполнения задачи необходимо %.2f ГиБ дискового пространства, но свободно только %.2f ГиБ.

source: Starting the job for %s
ru: Запущена задача для %s

source: A pause has been requested for the job
ru: Запрошена приостановка задачи

source: Fetching data
ru: Получение данных

source: Downloading manifest
ru: Скачивание манифеста

source: Downloading patch
ru: Скачивание патча

source: Verifying installed files
ru: Проверка установленных файлов

source: Downloading new data
ru: Скачивание новых данных

source: Patching
ru: Патчинг

source: Installing new data
ru: Установка новых данных

source: Deleting delisted content
ru: Удаление исключённых файлов

source: Finalizing
ru: Завершение

source: Unknown stage
ru: Неизвестная стадия

source: Job stage updated: %s
ru: Изменена стадия выполнения задачи: %s

source: %uh
ru: %uч

source: %umin
ru: %uмин

source: %usec
ru: %uсек

source: %.2f GiB
ru: %.2f ГиБ

source: %.1f MiB
ru: %.1f МиБ

source: %u KiB
ru: %u КиБ

source: %.2f Gbit/s
ru: %.2f Гбит/с

source: %.1f Mbit/s
ru: %.1f Мбит/с

source: %u kbit/s
ru: %u кбит/s

source: General commands: help - Display this message exit - Exit the program quit - Synonym for "exit"
ru: Общие команды: help - Отобразить это сообщение exit - Завершить работу программы quit - Синоним "exit"

source: Application manager commands: am init <path> - Initialize application manager at specified directory, allowing the following commands to be used. Specifying <path> as empty string ("") implies using current working directory am close - Close current application manager instance, allowing it to be initialized in another directory later am set-workshop-dir <path> - Set Steam Workshop directory path for current application manager instance. You cannot run jobs for Steam Workshop items before executing this command am status - Get current status of all items managed by current application manager instance am check-for-updates - Check for all item updates. The results can be viewed via "am status" command For the commands below, <item_id> is either <app_id>-<depot_id> or <app_id>-<depot_id>-<workshop_item_id> am create-job <item_id> <manifest_id> <force_verify> - Create a job for specified item. This command won't run the created job automatically, for that use "run-job" command. Only one job can exist for an item at a time; if you want to create another job, the previous one must be successfully finished or cancelled first. <manifest_id> can be ID of the manifest to update to or verify against, or 0 to use ID of the latest available manifest, or -1 to uninstall the item. <force_verify> must be either "true" or "false"; if "true", file verification will still be performed even if it's otherwise not necessary am run-job <item_id> - Run/resume a job for specified item. It can be paused by sending a SIGINT signal (Ctrl+C) or terminating the program am cancel-job <item_id> - Cancel a job for specified item, cleaning up its cache directory and resetting its state
ru: Команды менеджера приложений: am init <путь> - Инициализировать менеджер приложений в указанной папке, открывая возможность использовать последующие команды. Указание <пути> пустой строкой ("") означает использование текущей рабочей директории am close - Закрыть текущий менеджер приложений, позволяя затем инициализировать его в другой папке am set-workshop-dir <путь> - Установить путь к папке для объектов Мастерской Steam для текущего менеджера приложений. Запускать задачи для объектов Мастерской Steam невозможно до выполнения этой команды am status - Отобразить текущий статус всех объектов под управлением текущего менеджера приложений am check-for-updates - Проверить наличие обновлений для всех объектов. Результат можно увидеть с помощью команды "am status" В нижеприведённых командах, <id_объекта> может быть либо <app_id>-<depot_id>, либо <app_id>-<depot_id>-<workshop_item_id> am create-job <id_объекта> <id_манифеста> <проверять> - Создать задачу для указанного объекта. Эта команда не запустит созданную задачу автоматически, для этого используйте команду "run-job". У каждого объекта одновременно может быть только одна задача; для создания другой задачи, предыдущая должна быть сначала успешно завершена либо отменена. <id_манифеста> может быть ID манифеста, до которого нужно обновиться, или относительно которого нужно проверить файлы, либо 0, чтобы использовать ID последнего доступного манифеста, либо -1, чтобы деинсталлировать объект. <проверять> должен быть либо "true" либо "false"; если "true", проверка файлов будет произведена даже если в ней нет текущей необходимости am run-job <id_объекта> - Запустить/возобновить задачу для указанного объекта. Она может быть приостановлена посылкой сигнала SIGINT (Ctrl+C) или завершением работы программы am cancel-job <id_объекта> - Отменить задачу для указанного объекта, путём очистки её кэша и сброса состояния

source: am dump <type> <item_id> <manifest_id> - Dump specified tek-steamclient content file into a human-readable text file at current working directory. The file must be present in current application manager's directories, i.e. for manifests they must've been downloaded before, for other types there must be a job paused after creating that file. <type> must be one of: "manifest", "patch", "vcache", "delta". <manifest_id> is only used when <type> is "manifest" and can be set to 0 otherwise
ru: am dump <тип> <item_id> <manifest_id> - Сделать человекочитаемый дамп указанного файла tek-steamclient в текстовый файл в текущей рабочей директории. Файл должен присутствовать в рабочих папках текущего менеджера приложений, т.е. для манифестов это означает, что они должны уже быть скачаны, для остальных типов должна быть задача, приостановленная после создания этого файла. <тип> должен быть одним из: "manifest", "patch", "vcache", "delta". <manifest_id> используется только когда указан <тип> "manifest", и может быть указан как 0 в остальных случаях

source: tek-s3 client commands: s3c sync-manifest <url> - Synchronize manifest of tek-s3 server at specified URL, i.e. fetch its depot decryption keys and update list of apps/depots that it can provide manifest request codes for
ru: Команды клиента tek-s3: s3c sync-manifest <url> - Синхронизировать манифест сервера tek-s3 на указанном URL, т.е. получить его ключи дешифрования хранилищ и обновить список приложений/хранилищ, для которых он предоставляет коды запросов манифестов

source: Error: There is already an initialized application manager instance
ru: Ошибка: Менеджер приложений уже инициализирован

source: Failed to get current working directory: (%u) %s
ru: Не удалось получить текущую рабочую директорию: (%u) %s

source: Initialized application manager instance at
ru: Менеджер приложений инициализирован в

source: Application manager instance has been closed
ru: Менеджер приложений закрыт

source: Error: There is no initialized application manager instance to close
ru: Ошибка: Отсутствует инициализированный менеджер приложений

source: Workshop directory has been set to
ru: Папка объектов Мастерской установлена на

source: Error: There is no initialized application manager instance to set workshop directory for
ru: Ошибка: Отсутствует инициализированный менеджер приложений

source: No items are currently managed
ru: На текущий момент объектов нет

source: %s: job %llu->%llu
ru: %s: задача %llu->%llu

source: %s: manifest ID %llu%s
ru: %s: ID манифеста %llu%s

source: , update available
ru: , доступно обновление

source: Error: There is no initialized application manager instance to get status of
ru: Ошибка: Отсутствует инициализированный менеджер приложений

source: Check for updates succeeded
ru: Проверка наличия обновлений прошла успешно

source: Error: There is no initialized application manager instance to check for updates for
ru: Ошибка: Отсутствует инициализированный менеджер приложений

source: The job has been created successfully
ru: Задача успешно создана

source: Error: There is no initialized application manager instance to create job for
ru: Ошибка: Отсутствует инициализированный менеджер приложений

source: Error: Application manager doesn't have state for item %s
ru: Ошибка: У текущего менеджера приложений нет состояния объекта %s

source: The job has finished successfully
ru: Задача успешно завершена

source: The job has been paused successfully
ru: Задача успешно приостановлена

source: No mismatches have been found
ru: Несоответствий не найдено

source: The item is already up to date
ru: Объект уже имеет актуальную версию

source: Error: There is no initialized application manager instance to run job for
ru: Ошибка: Отсутствует инициализированный менеджер приложений

source: The job has been cancelled successfully
ru: Задача успешно отменена

source: Error: There is no initialized application manager instance to cancel job for
ru: Ошибка: Отсутствует инициализированный менеджер приложений

source: Error: There is no initialized application manager instance to dump for
ru: Ошибка: Отсутствует инициализированный менеджер приложений

source: Successfully synchronized tek-s3 manifest for "%s"
ru: Успешно синхронизирован манифест tek-s3 для "%s"

source: (%.2f GiB)
ru: (%.2f ГиБ)

source: (%.2f MiB)
ru: (%.2f МиБ)

source: (%.2f KiB)
ru: (%.2f КиБ)

source: Unknown status
ru: Неизвестный статус

source: Directory
ru: Папка

source: (%u files; %u subdirectories)
ru: (%u файлов; %u подпапок)

source: File
ru: Файл

source: (Size: %llu B%s; %u chunks)
ru: (Размер: %llu Б%s; %u чанков)

source: %sChunk %s (Offset: %llu; Size: %u B; Compressed size: %u B)
ru: %sЧанк %s (Смещение: %llu; Размер: %u Б; Сжатый размер: %u Б)

source: (Not verified yet; Dirty files: %u/%u; Dirty subdirectories: %u/%u; Remaining children: %u)
ru: (Ещё не проверена; "Грязных" файлов: %u/%u; "Грязных" подпапок: %u/%u; Осталось дочерних элементов: %u)

source: (Missing; %u files; %u subdirectories)
ru: (Отсутствует; %u файлов; %u подпапок)

source: (Verified; Dirty files: %u/%u; Dirty subdirectories: %u/%u)
ru: (Проверена; "Грязных" файлов: %u/%u; "Грязных" подпапок: %u/%u)

source: (Not verified yet; Dirty chunks: %u/%u; Remaining chunks: %u)
ru: (Ещё не проверен; "Грязных" чанков: %u/%u; Осталось чанков: %u)

source: (Verified; Dirty chunks: %u/%u)
ru: (Проверен; "Грязных" чанков: %u/%u)

source: (Missing; %u chunks)
ru: (Отсутствует; %u чанков)

source: (Verified (truncation to %llu B%s required); Dirty chunks: %u/%u)
ru: (Проверен (требуется усечение до %llu Б%s); "Грязных" чанков: %u/%u)

source: %sChunk %s (%s; Offset: %llu; Size: %u B; Compressed size: %u B)
ru: %sЧанк %s (%s; Смещение: %llu; Размер: %u Б; Сжатый размер: %u Б)

source: Not verified yet
ru: Ещё не проверен

source: Match
ru: Соответствует

source: Mismatch
ru: Не соответствует

source: New
ru: Новый

source: Delete
ru: На удаление

source: Children new
ru: Дочерние новые

source: Children download
ru: Дочерние скачать

source: Children patch
ru: Дочерние пропатчить

source: Children delete
ru: Дочерние на удаление

source: (%s; [%s]; %u files; %u subdirectories)
ru: (%s; [%s]; %u файлов; %u подпапок)

source: Download
ru: Скачать

source: Patch
ru: Пропатчить

source: Truncate to %llu B%s
ru: Усечь до %llu Б%s

source: (%s; [%s]; %u chunks; %u transfer operation groups)
ru: (%s; [%s]; %u чанков; %u групп трансферных операций)

source: ; Chunk buffer file offset: %llu
ru: ; Смещение в файле чанкового буфера: %llu

source: %sChunk %s (%s; Offset: %llu; Size: %u B; Compressed size: %u B%s)
ru: %sЧанк %s (%s; Смещение: %llu; Размер: %u Б; Сжатый размер: %u Б%s)

source: Transfer operation group %u
ru: Группа трансферных операций %u

source: ; Transfer buffer file offset: %llu
ru: ; Смещение в файле трансферного буфера: %llu

source: %sRelocation (%s; Source offset: %llu; Target offset: %llu; Size: %u B%s%s)
ru: %sРелокация (%s; Исходное смещение: %llu; Целевое смещение: %llu; Размер: %u Б%s%s)

source: %sPatch %s->%s (%s; Type: %s; Delta chunk size: %u B%s)
ru: %sПатч %s->%s (%s; Тип: %s; Размер дельта-чанка: %u Б%s)

source: Error: failed to open/create file "%s"
ru: Ошибка: не удалось открыть/создать файл "%s"

source: Error: failed to allocate indentation buffer
ru: Ошибка: не удалось выделить буфер отступов

source: Manifest %llu for %s Total chunks: %u Total files: %u Total directories: %u Total size of listed files: %llu B%s Content tree:
ru: Манифест %llu для %s Всего чанков: %u Всего файлов: %u Всего папок: %u Суммарный размер файлов: %llu Б%s Дерево содержимого:
