Repository: teknology-hub/tek-steamclient
Catalog: po/*.po
Languages: ru

source: Error: There is no unfinished job for item %s
ru: Ошибка: Для объекта %s нет незавершённой задачи

source: Error: There is no patch used for item %s's job
ru: Ошибка: Задача для объекта %s не использует патч

source: Patch from manifest %llu to manifest %llu for %s Total chunks: %u Total size of delta chunks: %llu B%s Chunks:
ru: Патч с манифеста %llu до манифеста %llu для %s Всего чанков: %u Суммарный размер дельта-чанков: %llu Б%s Чанки:

source: %s->%s (Type: %s; Delta chunk size: %u B)
ru: %s->%s (Тип: %s; Размер дельта-чанка: %u Б)

source: Verification cache for manifest %llu for %s Total chunks in manifest: %u Total files in manifest: %u Total directories in manifest: %u Content tree:
ru: Кэш проверки для манифеста %llu для %s Всего чанков в манифесте: %u Всего файлов в манифесте: %u Всего папок в манифесте: %u Дерево содержимого:

source: Delta from manifest %llu to manifest %llu for %s Depot patch used: %s
ru: Дельта с манифеста %llu до манифеста %llu для %s Используется патч: %s

source: Yes
ru: Да

source: No
ru: Нет

source: Verification delta for manifest %llu for %s
ru: Дельта по результатам проверки для манифеста %llu для %s

source: Downloading
ru: Скачивание

source: Installing
ru: Установка

source: Deleting
ru: Удаление

source: Total chunks: %u Total transfer operations: %u Total transfer operation groups: %u Total files: %u Total directories: %u Current stage: %s Total deletions: %u
ru: Всего чанков: %u Всего трансферных операций: %u Всего групп трансферных операций: %u Всего файлов: %u Всего папок: %u Текущая стадия: %s Всего удалений: %u

source: RAM transfer buffer size: %u B%s
ru: Размер трансферного буфера в ОЗУ: %u Б%s

source: Total download size: %llu B%s
ru: Суммарный объём скачивания: %llu Б%s

source: Total patching read/write size: %llu B%s
ru: Суммарный объём чтения/записи на этапе патчинга: %llu Б%s

source: Total file growth: %llu B%s
ru: Суммарный рост размера файлов: %llu Б%s

source: Estimated required disk space: %llu B%s
ru: Требуемый объём дискового пространства: %llu Б%s

source: Failed to initialize tek-steamclient library context
ru: Не удалось инициализировать контекст библиотеки tek-steamclient

source: tek-steamclient %s Enter "help" to list available commands
ru: tek-steamclient %s Введите "help" для отображения списка доступных команд

source: Failed to read input string
ru: Не удалось прочитать введённую строку

source: Error: The command is missing closing %c character
ru: Ошибка: В команде нет закрывающего символа %c

source: Warning: Failed to register window class
ru: Предупреждение: Не удалось зарегистрировать класс окна

source: Warning: Failed to create window instance
ru: Предупреждение: Не удалось создать экземпляр окна

source: An error has occurred Error type: (%u) %s Primary message: (%u) %s
ru: Произошла ошибка Тип ошибки: (%u) %s Основное сообщение: (%u) %s

source: Auxiliary message: (%u) %s
ru: Вторичное сообщение: (%u) %s

source: Operation completed successfully
ru: Операция завершилась успешно

source: AES decryption error
ru: Ошибка дешифрования AES

source: Failed to initialize asynchronous I/O context
ru: Не удалось инициализировать контекст асинхронного I/O

source: Failed to create an application manager instance
ru: Не удалось создать экземпляр менеджера приложений

source: Failed to insert a database row
ru: Не удалось вставить строку базы данных

source: Failed to update a database row
ru: Не удалось обновить строку базы данных

source: Application manager job I/O error
ru: I/O-ошибка задачи менеджера приложений

source: The job is already running
ru: Задача уже запущена

source: Steam didn't provide any manifest ID for this item
ru: Steam не предоставил никакого ID манифеста для этого объекта

source: There is no job for this item
ru: Для этого объекта нет задачи

source: Attempting to start a job for a Steam Workshop item, but no directory for such items was provided
ru: Попытка запустить задачу для работы Мастерской Steam, но папка для них не была установлена

source: There is already an unifnished job for this item
ru: У этого объекта уже есть незавершённая задача

source: Attempting to uninstall an item with unknown current manifest ID
ru: Попытка деинсталлировать объект с неизвестным текущим ID манифеста

source: Failed to set Steam Workshop item directory
ru: Не удалось установить папку для работ Мастерской Steam

source: Worker thread error
ru: Ошибка рабочего потока

source: Failed to get PICS access token
ru: Не удалось получить токен доступа PICS

source: PICS access token request has been denied
ru: Запрос на токен доступа PICS был отклонён

source: There is another incomplete authentication session on the client
ru: У клиента есть другая незавершённая сессия аутентификации

source: Steam CM authenticaiton session failed
ru: Сессия аутентификации Steam CM провалена

source: Failed to get PICS changes
ru: Не удалось получить список изменений PICS

source: Failed to connect to a Steam CM server
ru: Не удалось подключиться к серверу Steam CM

source: Failed to create a CM client instance
ru: Не удалось создать экземпляр CM-клиента

source: Failed to get depot decryption key
ru: Не удалось получить ключ дешифрования хранилища

source: Failed to get depot patch information
ru: Не удалось получить информацию о патче

source: Abnormal disconnection from a Steam CM server
ru: Неожиданное отключение от сервера Steam CM

source: Failed to get encrypted app ticket
ru: Не удалось получить зашифрованный тикет приложения

source: Failed to get account license list
ru: Не удалось получить список лицензий аккаунта

source: Missing PICS access token
ru: Отсутствует токен доступа PICS

source: Failed to get manifest request code
ru: Не удалось получить код запроса манифеста

source: Not connected to a server
ru: Не подключён к серверу

source: Not signed into an account
ru: Не вошёл в аккаунт

source: Failed to encrypt account password
ru: Не удалось зашифровать пароль аккаунта

source: Failed to get PICS product information
ru: Не удалось получить информацию о продукте PICS

source: Failed to fetch Steam CM server list
ru: Не удалось получить список серверов Steam CM

source: Got empty server list
ru: Получен пустой список серверов

source: Server unavailable
ru: Сервер недоступен

source: Failed to sign into a Steam account
ru: Не удалось войти в аккаунт Steam

source: Failed to get SteamPipe server list
ru: Не удалось получить список серверов SteamPipe

source: Got empty SteamPipe server list
ru: Получен пустой список серверов SteamPipe

source: Failed to submit Steam Guard code
ru: Не удалось отправить код Steam Guard

source: Timed out waiting for server response
ru: Истекло время ожидания ответа от сервера

source: The authentication token has expired
ru: Токен аутентификации истёк

source: Invalid authentication token
ru: Недействительный токен аутентификации

source: The token is not renewable
ru: Токен не подлежит продлению

source: Failed to renew Steam authentication token
ru: Не удалось продлить токен аутентификации Steam

source: Unknown app/package ID
ru: Неизвестный ID приложения/пакета

source: Failed to get Steam Workshop item details
ru: Не удалось получить описание работы Мастерской Steam

source: Failed to query Steam Workshop items
ru: Не удалось запросить список работ Мастерской Steam

source: CRC32 checksum mismatch
ru: Несоответствие контрольной суммы CRC32

source: Failed to initialize curl easy handle
ru: Не удалось инициализировать хэндл curl easy

source: Failed to initialize curl multi handle
ru: Не удалось инициализировать хэндл curl multi

source: Failed to initialize curl URL handle
ru: Не удалось инициализировать хэндл curl URL

source: Depot delta deserialization error
ru: Ошибка десериализации дельты

source: Provided manifests do not match the ones expected by the delta
ru: Предоставленные манифесты не соответствуют тем, которые указаны в дельте

source: Provided patch does not match the one expected by the delta
ru: Предоставленный патч не соответствует тому, который указан в дельте

source: Depot decryption key not found in the cache
ru: Ключ дешифрования хранилища не найден в кэше

source: GZip decompression failure
ru: Ошибка декодирования GZip

source: Encountered invalid data
ru: Обнаружены некорректные данные

source: Invalid URL was specified
ru: Указан некорректный URL

source: JSON parsing error
ru: Ошибка парсинга JSON

source: LZMA decompression failure
ru: Ошибка декодирования LZMA

source: Magic number mismatch
ru: Несоответствие магического числа

source: Depot manifest deserialization error
ru: Ошибка десериализации манифеста

source: Depot manifest parsing error
ru: Ошибка парсинга манифеста

source: Memory allocation error
ru: Ошибка выделения памяти

source: Depot patch deserialization error
ru: Ошибка десериализации патча

source: Protobuf deserialization failure
ru: Ошибка десериализации Protobuf

source: Protobuf serialization failure
ru: Ошибка сериализации Protobuf

source: Provided manifests do not match the ones expected by the patch
ru: Предоставленные манифесты не соответствуют тем, которые указаны в патче

source: Depot patch parsing error
ru: Ошибка парсинга патча

source: The job has been paused
ru: Задача была приостановлена

source: Failed to fetch tek-s3 server manifest
ru: Не удалось получить манифест сервера tek-s3

source: Failed to get manifest request code from tek-s3 server
ru: Не удалось получить код запроса манифеста с сервера tek-3

source: Failed to establish WebSocket connection to the tek-s3 server
ru: Не удалось установить WebSocket-подключение к серверу tek-s3

source: Abnormal disconnection from the tek-s3 server
ru: Неожиданное отключение от сервера tek-s3

source: SHA-1 hashing error
ru: Ошибка хеширования SHA-1

source: Failed to download chunk from SteamPipe
ru: Не удалось скачать чанк со SteamPipe

source: Failed to decode chunk
ru: Не удалось декодировать чанк

source: Failed to create a chunk decoding context
ru: Не удалось создать контекст декодирования чанка

source: Failed to download depot manifest from SteamPipe
ru: Не удалось скачать манифест со SteamPipe

source: Failed to download depot patch from SteamPipe
ru: Не удалось скачать патч со SteamPipe

source: There is already a maximum number of active requests on the thread
ru: На потоке уже максимальное количество активных запросов

source: Failed to create SteamPipe multi downloader
ru: Не удалось создать мульти-загрузчик SteamPipe

source: Unknown chunk compression method
ru: Неизвестный метод сжатия чанка

source: Item installation is already up to date
ru: Установленный объект уже актуальной версии

source: Verification cache deserialization error
ru: Ошибка десериализации кэща проверки

source: Verification cache does not bind to the provided manifest
ru: Кэш проверки не привязан к предоставленному манифесту

source: VDF parsing error
ru: Ошибка парсинга VDF

source: Failed to start a worker thread
ru: Не удалось запустить рабочий поток

source: Zip extraction failure
ru: Ошибка извлечения Zip

source: Zstandard decompression failure
ru: Ошибка декодирования Zstandard

source: There are no available tek-s3 servers
ru: Нет доступных серверов tek-s3

source: Failed to get depot decryption key from tek-s3 server
ru: Не удалось получить ключ дешифрования хранилища с сервера tek-s3

source: Failed to get PICS access token from tek-s3 server
ru: Не удалось получить токен доступа PICS с сервера tek-3

source: Failed to get CDN auth token
ru: Не удалось получить токен авторизации CDN

source: Loaded libcurl version does not support WSS protocol
ru: Загруженная версия libcurl не поддерживает протокол WSS

source: Unknown
ru: Неизвестно

source: Invalid EResult value
ru: Некорректное значение EResult

source: OK
ru: ОК

source: Failure
ru: Ошибка

source: No connection
ru: Нет соединения

source: Invalid password
ru: Неверный пароль

source: Already logged in elsewhere
ru: Уже авторизован в другом месте

source: Invalid protocol version
ru: Неправильная версия протокола

source: Invalid parameter
ru: Неверный параметр

source: File not found
ru: Файл не найден

source: Busy
ru: Занят

source: Invalid state
ru: Некорректное состояние

source: Invalid name
ru: Некорректное имя

source: Invalid email address
ru: Некорректный email

source: Duplicate name
ru: Дубликат имени

source: Access denied
ru: Отказ в доступе

source: Timeout
ru: Истекло время ожидания

source: Banned
ru: Забанен

source: Account not found
ru: Аккаунт не найден

source: Invalid Steam ID
ru: Неверный Steam ID

source: Service unavailable
ru: Сервис недоступен

source: Not logged on
ru: Не авторизован

source: Encryption failure
ru: Ошибка шифрования

source: Insufficient privilege
ru: Недостаточно привилегий

source: Limit exceeded
ru: Превышен лимит

source: Revoked
ru: Отозван

source: Expired
ru: Истёк срок

source: Already redeemed
ru: Уже получен

source: Duplicate request
ru: Дупликат запроса

source: Already owned
ru: Уже во владении

source: IP not found
ru: IP не найден

source: I/O failure
ru: Ошибка I/O

source: Remote disconnect
ru: Удалённое отключение

source: Shopping cart not found
ru: Корзина не найдена

source: Blocked
ru: Заблокирован

source: Ignored
ru: Игнорирован

source: No match
ru: Нет соответствия

source: Account disabled
ru: Аккоунт отключён

source: Service read-only
ru: Сервис только для чтения

source: Content version
ru: Версия контента

source: Try another Steam CM server
ru: Попробуйте другой сервер Steam CM

source: Suspended
ru: Простановлен

source: Cancelled
ru: Отменён

source: Data corruption
ru: Повреждение данных

source: Disk full
ru: Диск полон

source: Remote call failed
ru: Ошибка удалённого вызова

source: Illegal password
ru: Недействительный пароль

source: Not modified
ru: Не модифицирован

source: No mobile device
ru: Нет мобильного устройства

source: Time not synced
ru: Время не синхронизировано

source: Account limit exceeded
ru: Превышен лимит аккаунта

source: Account activity limit exceeded
ru: Превышен лимит активности аккаунта

source: Phone activity limit exceeded
ru: Превышен лимит телефонной активности

source: Email send failure
ru: Ошибка отправки email

source: Invalid item type
ru: Неверный тип предмета

source: IP banned
ru: IP забанен

source: Insufficient funds
ru: Недостаточно средств

source: Account not friends
ru: Аккаунт не в друзьях

source: Limited user account
ru: Ограниченый пользовательский аккаунт

source: Can't remove item
ru: Невозможно удалить предмет

source: Account deleted
ru: Аккаунт удалён

source: Existing user cancelled license
ru: Существующий пользователь отменил лицензию

source: Community cooldown
ru: Кулдаун сообщества

source: No launcher specified
ru: Не указан лаунчер

source: Must agree to Steam Subscriber Agreement
ru: Требуется согласиться со Steam Subscriber Agreement

source: Launcher migrated
ru: Миграция лаунчера

source: Steam realm mismatch
ru: Несоответствие Steam realm

source: Invalid signature
ru: Некорректная сигнатура

source: Parse failure
ru: Ошибка парсинга

source: No verified phone
ru: Нет подтверждённого телефона

source: Insufficient battery
ru: Недостаточно заряда батареи

source: Charger required
ru: Требуется зарядное устройство

source: Cached credential invalid
ru: Неверные закэшированные учётные данные

source: Phone number is VoIP
ru: Номер телефона является VoIP

source: Not supported
ru: Не поддерживается

source: Family size limit exceeded
ru: Превышен лимит размера семьи

source: Checking for existence
ru: Проверка существования

source: Creating or opening
ru: Создание или открытие

source: Getting type of filesystem entry
ru: Получение типа элемента файловой системы

source: Getting file size
ru: Получение размера файла

source: Truncating
ru: Усечение

source: Reading data
ru: Чтение данных

source: Writing data
ru: Запись данных

source: Setting attributes or permissions
ru: Установка атрибутов или прав

source: Copying data
ru: Копирование данных

source: Moving
ru: Перемещение

source: Creating symbolic link
ru: Создание символьной ссылки

source: Registering for asynchronous I/O
ru: Регистрация для асинхронного I/O

source: Submitting an asynchronous I/O request
ru: Отправка запроса асинхронного I/O

source: Waiting for asynchronous I/O completions
ru: Ожидание завершения асинхронного I/O

source: Normal closure
ru: Нормальное закрытие

source: Going away
ru: Сервер закрывается

source: Protocol error
ru: Ошибка протокола

source: Unsupported data
ru: Неподдерживаемые данные

source: No status code received
ru: Не получен код статуса

source: Abnormal closure
ru: Неожиданное закрытие

source: Invalid payload
ru: Неверное содержимое

source: Policy violation
ru: Нарушение политики

source: Message too big
ru: Слишком большое сообщение

source: Mandatory extension not supported
ru: Не поддерживается обязательное расширение

source: Internal server error
ru: Внутренняя ошибка сервера

source: Service restart
ru: Перезапуск сервиса

source: Try again later
ru: Попробуйте снова позже

source: Bad gateway
ru: Плохой шлюз

source: TLS handshake failure
ru: Ошибка рукопожатия TLS

source: Steam CM normal closure
ru: Нормальное закрытие (Steam CM)

source: Basic
ru: Базовый

source: WebSocket close code: (%u) %s
ru: Код закрытия соединения WebSocket: (%u) %s

source: Compound
ru: Составной

source: Steam CM response
ru: Ответ Steam CM

source: OS
ru: ОС

source: I/O operation type: (%u) %s
ru: Тип I/O-операции: (%u) %s

source: Path
ru: Путь

source: HTTP status code: %u
ru: Код статуса HTTP: %u
